# 字符串与通用命令

![redis-string](https://tva1.sinaimg.cn/large/008i3skNgy1gthv08m9w7j60wx0jygmm02.jpg)

字符串是Redis五大数据结构之一，也是最常用的数据结构，今天我们就来学习一些字符串操作的常用命令。

## 字符串命令

|命令|描述|使用方式|
|:-----:|--------|--------|
| SET | 设置指定 key 的值 | SET key value |
| GET |	获取指定 key 的值 | GET key |
| GETSET | 将给定 key 的值设为 value ，并返回key的旧值 | GETSET key value |
| GETRANGE | 返回 key 中字符串值的子字符 | GETRANGE key start end |
| MSET | 同时设置一个或多个key-value键值对对 | MSET key1 value1 key2 value2 ...|
| MGET | 获取所有(一个或多个)给定 key 的值 | MGET key1 key2 |
| SETEX | 设置 key 的值为 value 同时将过期时间设为 seconds | SETEX key seconds value |
| SETNX | 只有在 key 不存在时设置 key 的值 | SETNX key value |
| SETRANGE | 从偏移量 offset 开始用 value 覆写给定 key 所储存的字符串值 | SETRANGE key offset value |
| STRLEN | 返回 key 所储存的字符串值的长度 | STRLEN key |
| APPEND | 将 value 追加到 key 原来的值的末尾 | APPEND key value |
| INCR | 将 key 中储存的数字值增一 | INCR key |
| INCRBY | 将 key 所储存的值加上给定的增量值 ( increment ) | INCRBY key count |
| INCRBYFLOAT | 将 key 所储存的值加上给定的浮点增量值 ( increment ) | INCRBYFLOAT key floatcount |
| DECR | 将 key 中储存的数字值减一 | DECR key |
| DECRBY | 将 key 所储存的值减去给定的减量值 ( decrement ) | DECRBY key count |

举例如下：
```bash
redis:6379> set name eason
OK
redis:6379> get name
"eason"
redis:6379> getset name zhangsan
"eason"
redis:6379> getrange name 2 4
"ang"
redis:6379> mset age 18 sex man
OK
redis:6379> mget age sex
1) "18"
2) "man"
redis:6379> setex name 10 eason
OK
redis:6379> setnx name zhangsan
(integer) 1
redis:6379> setnx name zhangsan
(integer) 0
redis:6379> setrange name 2 lisi
(integer) 8
redis:6379> get name
"zhlisian"
redis:6379> strlen name
(integer) 8
redis:6379> append name wangwu
(integer) 14
redis:6379> get name
"zhlisianwangwu"
redis:6379> incr count
(integer) 1
redis:6379> incr count
(integer) 2
redis:6379> decr count
(integer) 1
redis:6379> incrby count 3
(integer) 4
redis:6379> decrby count 2
(integer) 2
redis:6379> incrbyfloat count 2.5
"4.5"
```

## 通用命令
下面是一些通用的命令，与具体的数据结构无关，但是经常容易被使用到。

|命令|描述|使用方式|
|:-----:|--------|--------|
| PING | 检测 redis 服务是否启动。 | PING, 返回PANG,表示启动 |
| DEL | 用于删除 key | DEL key |
| EXISTS | 检查给定 key 是否存在 | EXISTS key |
| KEYS | 查找所有符合给定模式的 key | KEYS *, 时间复杂度高，谨慎使用 |
| RENAME | 修改 key 的名称 | RENAME key newKey |
| TYPE | 返回 key 所储存的值的类型 |TYPE key|
| PEXPIRE |	设置 key 的过期时间，以毫秒计 | 
| PERSIST |	移除 key 的过期时间，key 将持久保持
| PTTL | 以毫秒为单位返回 key 的剩余的过期时间
| TTL |	以秒为单位，返回给定 key 的剩余生存时间

举例如下：
```bash
redis:6379> PING
PONG
redis:6379> del age
(integer) 1
redis:6379> exists age
(integer) 0
redis:6379> exists name
(integer) 1
redis:6379> keys *
1) "mylist"
2) "sex"
3) "name"
4) "count"
5) "mystr"
6) "myset2"
7) "myhash"
8) "myset"
redis:6379> keys my*
1) "mylist"
2) "mystr"
3) "myset2"
4) "myhash"
5) "myset"
redis:6379> type name
string
redis:6379> type count
string
redis:6379> set name eason
OK
redis:6379> PEXPIRE name 10000
(integer) 1
redis:6379> ttl name
(integer) 8
redis:6379> PERSIST name
(integer) 1
redis:6379> get name
"eason"
redis:6379> PEXPIRE name 10000
(integer) 1
redis:6379> pttl name
(integer) 4913
redis:6379> pttl name
(integer) 3032
redis:6379> ttl name
(integer) 0
redis:6379> ttl name
(integer) -2
redis:6379> get name
(nil)
```

