# Hash与List

![redis-data-contructor](https://tva1.sinaimg.cn/large/008i3skNgy1gtok7f2wy6j61050lndhc02.jpg)

## Redis Hashes

Redis hash 是一个 string 类型的 field 和 value 的映射表，hash 特别适合用于存储对象, 你可以把redis hash想象成一个小的redis，每个哈希键中可以存储多达 40 亿个字段值对。

|命令|描述|使用方式|
|:-----:|--------|--------|
| HMSET	| 同时将多个 field-value (域-值)对设置到哈希表 key 中 | HMSET name key1 val1 key2 val2... |
| HSET	| 将哈希表 key 中的字段 field 的值设为 value | HSET name key value |
| HSETNX | 只有在字段 field 不存在时，设置哈希表字段的值 | HSETNX name key value |
| HGET	| 获取存储在哈希表中指定字段的值 | HGET name key |
| HGETALL |	获取在哈希表中指定 key 的所有字段和值 | HGETALL name |
| HMGET | 获取所有给定字段的值 | HMGET name key1 key2...|
| HEXISTS |	查看哈希表 key 中，指定的字段是否存在 | HEXISTS name key |
| HKEYS	| 获取所有哈希表中的字段 | HKEYS name |
| HVALS	| 获取哈希表中所有值| HVALS name |
| HDEL | 删除一个或多个哈希表字段 | HDEL name key |
| HINCRBY |	为哈希表 key 中的指定字段的整数值加上增量 increment | HINCRBY name key increment |
| HINCRBYFLOAT | 为哈希表 key 中的指定字段的浮点数值加上增量 increment | HINTCRBYFLOAT name key increment |
| HLEN | 获取哈希表中字段的数量 | HLEN name |
| HSTRLEN |	返回哈希表 key 中， 与给定域 field 相关联的值的字符串长度 | HSRTLEN name key |

举例如下：

  ```bash
    redis:6379> hmset hash name eason age 18 sex man
    OK
    redis:6379> hgetall hash
    1) "name"
    2) "eason"
    3) "age"
    4) "18"
    5) "sex"
    6) "man"
    redis:6379> hset hash name zhangsan
    (integer) 0
    redis:6379> hget hash name
    "zhangsan"
    redis:6379> hsetnx hash name lisi
    (integer) 0
    redis:6379> hget hash name
    "zhangsan"
    redis:6379> hsetnx hash size 20
    (integer) 1
    redis:6379> hget hash size
    "20"
    redis:6379> hmget hash name age size
    1) "zhangsan"
    2) "18"
    3) "20"
    redis:6379> hexists hash name
    (integer) 1
    redis:6379> hexists hash height
    (integer) 0
    redis:6379> hkeys hash
    1) "name"
    2) "age"
    3) "sex"
    4) "size"
    redis:6379> hvals hash
    1) "zhangsan"
    2) "18"
    3) "man"
    4) "20"
    redis:6379> hdel hash size
    (integer) 1
    redis:6379> hkeys hash
    1) "name"
    2) "age"
    3) "sex"
    redis:6379> hlen hash
    (integer) 3
    redis:6379> hstrlen hash name
    (integer) 8
    redis:6379> hincrby hash age 3
    (integer) 21
    redis:6379> hget hash age
    "21"
  ```
