# Set与Zset

![redis-set-hashes](https://tva1.sinaimg.cn/large/008i3skNgy1gtpqx97dvaj60sk0ft75h02.jpg)

## Redis Set

***Redis 的 Set 是 string 类型的无序集合。***

Set有以下特点：
* 集合成员是唯一的，这就意味着集合中没有重复的数据。
* 在 Redis 中，添加、删除和查找的时间复杂都是 O(1)（不管 Set 中包含多少元素）。
* 集合中最大的成员数为 232 – 1 (4294967295), 每个集合可存储 40 多亿个成员。

### 主要有以下命令：

|命令|描述|使用方式|
|:-----:|--------|--------|
| SADD | 向集合添加一个或多个成员 | SADD name ele1 ele2...|
| SCARD | 获取集合的成员数 | SCARD name |
| SMEMBERS | 返回集合中的所有成员 | SMEMBERS name |
| SREM | 移除集合中一个或多个成员 | SREM name ele1 ele2...|
| SPOP | 移除并返回集合中的一个随机元素 | SPOP name |
| SRANDMEMBER | 返回集合中一个或多个随机数 | SRANDMEMBER name |
| SISMEMBER	| 判断 member 元素是否是集合 key 的成员 | SISMEMBER name member |
| SDIFF	| 返回给定所有集合的差集 | SDIFF name1 name2 |
| SDIFFSTORE | 返回给定所有集合的差集并存储在 destination 中 | SDIFFSTORE destination name1 name 2 |
| SINTER | 返回给定所有集合的交集 | SINTER name1 name2|
| SINTERSTORE | 返回给定所有集合的交集并存储在 destination 中 | SINTERSTORE destination name1 name2 |
| SUNION | 返回所有给定集合的并集| SUNION name1 name2 |
| SUNIONSTORE | 所有给定集合的并集存储在 destination 集合中 | SUNION destination name1 name2 |
| SSCAN | 迭代集合中的元素 | SSCAN name cursor |
| SMOVE | 将 member 元素从 source 集合移动到 destination 集合| SMOVE name distination ele | 

举例如下：
  ```bash
    redis:6379> sadd myset eason lijinghua lili zhangsan
    (integer) 4
    redis:6379> scard myset
    (integer) 4
    redis:6379> smembers myset
    1) "zhangsan"
    2) "lijinghua"
    3) "eason"
    4) "lili"
    redis:6379> srem myset zhangsan eason
    (integer) 2
    redis:6379> smembers myset
    1) "lijinghua"
    2) "lili"
    redis:6379> spop myset
    "lili"
    redis:6379> srandmember myset
    "eason"
    redis:6379> sismember myset eason
    (integer) 1
    redis:6379> sismember myset wangwu
    (integer) 0
    redis:6379> smembers myset2
    1) "susu"
    2) "zhangsan"
    3) "wangwu"
    redis:6379> sdiff myset myset2
    1) "lijinghua"
    2) "eason"
    3) "lisi"
    redis:6379> sinter myset myset2
    1) "zhangsan"
    2) "susu"
    3) "wangwu"
    redis:6379> sunion myset myset2
    1) "susu"
    2) "zhangsan"
    3) "wangwu"
  ```

## Redis Zset

Redis Zset和set一样也是string类型元素的集合，且不允许重复的成员。

不同的是每个元素都会关联一个double类型的分数。Redis正是通过分数来为Zset中的成员进行从小到大的排序。

Zset的成员是唯一的,但分数(score)却可以重复。

集合是通过哈希表实现的，所以添加，删除，查找的复杂度都是O(1)。

集合中最大的成员数为2的32次方减1(4294967295), 每个集合可存储 40 多亿个成员。

### 常用命名如下：

|命令|描述|使用方式|
|:-----:|--------|--------|
| ZADD | 向有序集合添加一个或多个成员，或者更新已存在成员的分数 | ZADD key socre member [socre memeber] |
| ZCARD |	获取有序集合的成员数 | ZCARD key |
| ZCOUNT | 计算在有序集合中指定区间分数的成员数 | ZCOUNT key min max |
| ZINCRBY	| 有序集合中对指定成员的分数加上增量 increment | ZINCRBY key increment memeber |
| ZLEXCOUNT	| 在有序集合中计算指定字典区间内成员数量 | ZLEXCOUNT key min max |
| ZRANGE | 通过索引区间返回有序集合成指定区间内的成员 | ZRANGE key min max |
| ZRANGEBYLEX |	通过字典区间返回有序集合的成员 | ZRANGEBYLEX key min max |
| ZRANGEBYSCORE |	通过分数返回有序集合指定区间内的成员 | ZRANGEBYSCORE key min max |
| ZRANK |	返回有序集合中指定成员的索引 | ZRANK key member |
| ZREM | 移除有序集合中的一个或多个成员 | ZREM key member1 member2... |
| ZREMRANGEBYLEX | 移除有序集合中给定的字典区间的所有成员 | ZRANGEBYLEX key min max |
| ZREMRANGEBYRANK |	移除有序集合中给定的排名区间的所有成员 | ZREMRANGEBYRANK key start stop | 
| ZREMRANGEBYSCORE | 移除有序集合中给定的分数区间的所有成员 | ZREMRANGEBYSCORE key min max |
| ZREVRANGE |	返回有序集中指定区间内的成员，通过索引，分数从高到底 | ZREVRANGE key start stop |
| ZREVRANGEBYSCORE | 返回有序集中指定分数区间内的成员，分数从高到低排序 | ZREVRANGEBYSCORE key min max |
| ZREVRANK | 返回有序集合中指定成员的排名，有序集成员按分数值递减(从大到小)排序 | ZREVRANK key member |
| ZSCORE | 返回有序集中，成员的分数值 | ZSCORE key member |

例如：
  ```bash
  redis:6379> zadd myzset 1 mysql
  (integer) 1
  redis:6379> zadd myzset 2 postgres 3 redis
  (integer) 2
  redis:6379> zcard myzset
  (integer) 3
  redis:6379> zcount myzset 1 3
  (integer) 3
  redis:6379> zcount myzset (1 3
  (integer) 2
  redis:6379> zincrby myzset 4 mysql
  "5"
  redis:6379> zadd myzset 0 a 0 b 0 c 0 d 0 e 0 f
  (integer) 6
  redis:6379> zlexcount myzset b e
  (error) ERR min or max not valid string range item
  redis:6379> zlexcount myzset (b (e
  (integer) 2
  redis:6379> zrange myzset 0 8
  1) "a"
  2) "b"
  3) "c"
  4) "d"
  5) "e"
  6) "f"
  7) "oracle"
  8) "postgres"
  9) "redis"
  redis:6379> zrangebylex myzset (b (f
  1) "c"
  2) "d"
  3) "e"
  redis:6379> zrangebyscore myzset 0 3
  1) "a"
  2) "b"
  3) "c"
  4) "d"
  5) "e"
  6) "f"
  7) "oracle"
  8) "postgres"
  9) "redis"
  redis:6379> zrank myzset mysql
  (integer) 9
  redis:6379> zrem myzset a b
  (integer) 2
  redis:6379> ZREMRANGEBYLEX myzset (c (f
  (integer) 2
  redis:6379> ZREMRANGEBYRANK myzset 0 1
  (integer) 2
  redis:6379> ZREMRANGEBYSCORE myzset 1 3
  (integer) 3
  redis:6379> zrange myzset 0 -1
  1) "mysql"
  redis:6379> zadd myzset 0 a 0 b 2 oracle 3 redis 4 sqlserver
  (integer) 5
  redis:6379> ZREVRANGE myzset 0 3
  1) "mysql"
  2) "sqlserver"
  3) "redis"
  4) "oracle"
  redis:6379> ZREVRANGEBYSCORE myzset 3 1
  1) "redis"
  2) "oracle"
  redis:6379> ZREVRANK myzset redis
  (integer) 2
  redis:6379> zscore myzset mysql
  "5"
 ```
